; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 913133 2 1 4 6 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image3 - mode
	spectrograph1 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Planet6 spectrograph1)
	(have_image Star7 thermograph2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 2
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 2
3. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   goals met: 0 of 2
4. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 2
5. (turn_to satellite0 groundstation5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 2
6. (turn_to satellite1 planet6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet6)
   goals met: 0 of 2
7. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 2
8. (take_image satellite1 planet6 instrument1 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 1 of 2
9. (turn_to satellite0 star7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star7)
   goals met: 1 of 2
10. (take_image satellite0 star7 instrument0 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 2 of 2
